# -----------------------------------------------------------------------------
# Filename: Brewfile
# Description: Homebrew packages with comments explaining each one.
# -----------------------------------------------------------------------------
# >>> Homebrew Taps <<<
tap "homebrew/bundle"                     # Manage multiple Homebrew dependencies
tap "homebrew/services"                   # Start/stop macOS services
tap "felixkratz/formulae"                 # Custom tools (e.g., SketchyBar, Borders)
tap "jesseduffield/lazygit"               # Fast Git UI
tap "nikitabobko/tap"                     # Miscellaneous useful CLI tools
tap "zegervdv/zathura"                    # Zathura PDF reader and extensions

# -----------------------------------------------
# >>> CLI <<<
# -----------------------------------------------
# --- Shells & Terminal Enhancements ---
brew "bash"                               # Bash shell
brew "nushell"                            # Modern shell with structured data support
brew "git"                                # Version control system
brew "zellij"                             # Terminal workspace manager (tmux alternative)
brew "yazi"                               # Terminal file manager with vim-like keybindings
brew "starship"                           # Fast, customizable shell prompt

# --- Terminal Plugins ---
brew "zoxide"                             # Smarter `cd` for quick directory jumping
brew "eza"                                # Modern replacement for `ls`
brew "fd"                                 # Fast file search alternative to `find`
brew "fzf"                                # Fuzzy finder for files and commands
brew "ripgrep"                            # Fast search tool for files (like grep)
brew "bat"                                # Syntax-highlighted file viewer with Git support
brew "carapace"                           # Shell completion framework
brew "zsh-autosuggestions"                # Suggests past commands as you type
brew "zsh-syntax-highlighting"            # Highlights commands as you type

brew "keychain"                           # Securely manage SSH keys
brew "stow"                               # Symlink manager for dotfiles

# -----------------------------------------------
# >>> Modal Editors <<<
# -----------------------------------------------
brew "neovim"                             # Modern Vim-based text editor
brew "helix"                              # Rust-based modal editor with LSP support

# -----------------------------------------------
# >>> Programming Languages & Runtimes <<<
# -----------------------------------------------
brew "python@3.13"                        # Python programming language
brew "rust"                               # Rust programming language
brew "node"                               # Node.js runtime
brew "lua"                                # Lightweight scripting language
brew "openjdk"                            # Java Development Kit

# --- Language Server Protocols ---
brew "python-lsp-server"                  # Language server for Python development
brew "basedpyright"                       # Python static type checker
brew "rust-analyzer"                      # Language server for Rust development
brew "lua-language-server"                # Language server for Lua development
brew "typescript-language-server"         # Language server for TypeScript
brew "vscode-langservers-extracted"       # Collection of useful language servers
brew "yaml-language-server"               # YAML support in editors
brew "texlab"                             # Language server for LaTeX
brew "marksman"                           # Markdown LSP server

# --- Python  ---
brew "pyenv"                              # Python version manager
brew "pyenv-virtualenv"                   # Python version manager
brew "uv"                                 # Python package manager (alternative to pip)
brew "ipython"                            # Interactive Python shell
brew "jupytext"                           # Convert Jupyter notebooks to plain scripts

# --- Lua ---
brew "luarocks"                           # Package manager for Lua
brew "luajit"                             # Just-In-Time compiler for Lua

# --- Linters & Formatters ---
brew "ruff"                               # Fast Python linter and formatter
brew "stylua"                             # Lua code formatter
brew "markdownlint-cli2"                  # Improved Markdown linter
brew "prettier"                           # Code formatter for multiple languages

# -----------------------------------------------
# >>> Media & Document Processing <<<
# -----------------------------------------------
brew "pandoc"                             # Document format converter
brew "tesseract"                          # Optical Character Recognition (OCR) tool
brew "imagemagick"                        # CLI tool for image conversion and processing
brew "ffmpeg"                             # Multimedia framework (video/audio conversion)
brew "webp"                               # Convert images to WebP format
brew "switchaudio-osx"                    # CLI for switching macOS audio devices
brew "nowplaying-cli"                     # Display currently playing media in the

# -----------------------------------------------
# >>> Additional Tools <<<
# -----------------------------------------------

# -----------------------------------------------
# >>> Custom Formulae <<<
# -----------------------------------------------
brew "jesseduffield/lazygit/lazygit"      # TUI Git client
brew "zegervdv/zathura/zathura"           # Zathura PDF reader
brew "zegervdv/zathura/zathura-pdf-mupdf" # MuPDF plugin for Zathura
brew "felixkratz/formulae/borders"        # macOS window borders

# -----------------------------------------------
# >>> Casks: GUI Applications <<<
# -----------------------------------------------
# --- Terminal ---
cask "ghostty"                            # Minimal terminal emulator
cask "wezterm"                            # GPU-accelerated terminal emulator

# --- IDE ---
cask "zed"                                # GPU-accelerated, minimal, and keyboard-first code editor
cask "visual-studio-code"                 # Lightweight code editor

cask "aerospace"                          # Window manager for macOS
cask "alfred"                             # Productivity app launcher
cask "espanso"                            # Text expander for macOS

cask "vlc"                                # Open-source media player
cask "zen-browser"                        # Minimalist web browser

# --- Office Tools ---
cask "libreoffice"                        # Open-source office suite
cask "libreoffice-language-pack"          # Language packs for LibreOffice
cask "zathura"                            # Zathura PDF reader
cask "zathura-pdf-mupdf"                  # MuPDF plugin for Zathura
cask "sioyek"                             # PDF reader optimized for research papers

# --- PKM ---
cask "obsidian"                           # Markdown note-taking app
cask "anki"                               # Flashcard-based learning tool
cask "xournal++"                          # Handwritten notes and PDF annotation tool
cask "calibre"                            # Ebook management software
cask "zotero"                             # Reference management software

# -----------------------------------------------
# >>> Fonts <<<
# -----------------------------------------------
cask "font-fira-code-nerd-font"           # Fira Code with Nerd Font glyphs
cask "font-hack-nerd-font"                # Hack font with Nerd Font glyphs
cask "font-jetbrains-mono-nerd-font"      # JetBrains Mono with Nerd Font glyphs
cask "font-sf-mono"                       # Apple's SF Mono font
cask "font-sf-pro"                        # Apple's SF Pro font
cask "sf-symbols"                         # Apple’s SF Symbols font and tools

# -----------------------------------------------
# >>> VS Code Extensions <<<
# -----------------------------------------------
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onelight"
vscode "alefragnani.project-manager"
vscode "andenetalexander.vim-cheatsheet"
vscode "arrterian.nix-env-selector"
vscode "asvetliakov.vscode-neovim"
vscode "ban.spellright"
vscode "batisteo.vscode-django"
vscode "bnavetta.zoterolatex"
vscode "brettm12345.nixfmt-vscode"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cweijan.epub-reader"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "dracula-theme.theme-dracula"
vscode "dunstontc.vscode-google-sheets-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "george-alisson.html-preview-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "goessner.mdmath"
vscode "grapecity.gc-excelviewer"
vscode "hongyin163.excel-to-html-table"
vscode "humao.rest-client"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ionide.ionide-fsharp"
vscode "iulian-radu-at.find-unused-exports"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jasew.vscode-helix-emulation"
vscode "jbockle.jbockle-format-files"
vscode "jebbs.markdown-extended"
vscode "jnoortheen.nix-ide"
vscode "juanallo.vscode-dependency-cruiser"
vscode "kaanaytekin.concise-sql-formatter"
vscode "kamadorueda.alejandra"
vscode "kevinrose.vsc-python-indent"
vscode "kortina.vscode-markdown-notes"
vscode "labnol.google-apps-script"
vscode "lacroixdavid1.vscode-format-context-menu"
vscode "leonidasiiv.google-sheets-equation-syntax-hightlighter"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "mathematic.vscode-latex"
vscode "matt-meyers.vscode-dbml"
vscode "mblode.zotero"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "molaidev.gscript-tools"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-repositories"
vscode "spadin.zmk-tools"
vscode "visualstudioexptteam.vscodeintellicode"
