# Taps
echo "Tapping Brew..."
brew tap FelixKratz/formulae
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
tap "zegervdv/zathura"
brew "python@3.13"
brew "webp"
brew "node"
brew "basedpyright"
brew "bash"
brew "carapace"
brew "eza"
brew "fd"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "helix"
brew "ipython"
brew "jupytext"
brew "keychain"
brew "lua"
brew "luarocks"
brew "markdownlint-cli"
brew "markdownlint-cli2"
brew "marksman"
brew "neovim"
brew "nowplaying-cli"
brew "nushell"
brew "openjdk"
brew "pandoc"
brew "prettier"
brew "pyenv"
brew "python-lsp-server"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "texlab"
brew "tmux"
brew "typescript-language-server"
brew "uv"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "jesseduffield/lazygit/lazygit"
brew "zegervdv/zathura/zathura"
brew "zegervdv/zathura/zathura-pdf-mupdf"
cask "aerospace"
cask "alfred"
cask "anki"
cask "espanso"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "karabiner-elements"
cask "libreoffice"
cask "libreoffice-language-pack"
cask "sf-symbols"
cask "sioyek"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "xournal++"
cask "zen-browser"
cask "zotero"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onelight"
vscode "alefragnani.project-manager"
vscode "andenetalexander.vim-cheatsheet"
vscode "arrterian.nix-env-selector"
vscode "asvetliakov.vscode-neovim"
vscode "ban.spellright"
vscode "batisteo.vscode-django"
vscode "bnavetta.zoterolatex"
vscode "brettm12345.nixfmt-vscode"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cweijan.epub-reader"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "dracula-theme.theme-dracula"
vscode "dunstontc.vscode-google-sheets-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "george-alisson.html-preview-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "goessner.mdmath"
vscode "grapecity.gc-excelviewer"
vscode "hongyin163.excel-to-html-table"
vscode "humao.rest-client"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ionide.ionide-fsharp"
vscode "iulian-radu-at.find-unused-exports"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jasew.vscode-helix-emulation"
vscode "jbockle.jbockle-format-files"
vscode "jebbs.markdown-extended"
vscode "jnoortheen.nix-ide"
vscode "juanallo.vscode-dependency-cruiser"
vscode "kaanaytekin.concise-sql-formatter"
vscode "kamadorueda.alejandra"
vscode "kevinrose.vsc-python-indent"
vscode "kortina.vscode-markdown-notes"
vscode "labnol.google-apps-script"
vscode "lacroixdavid1.vscode-format-context-menu"
vscode "leonidasiiv.google-sheets-equation-syntax-hightlighter"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "mathematic.vscode-latex"
vscode "matt-meyers.vscode-dbml"
vscode "mblode.zotero"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "molaidev.gscript-tools"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-repositories"
vscode "nachodecima.custom-css-sorter"
vscode "natqe.reload"
vscode "nhoizey.gremlins"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "oouo-diogo-perdigao.docthis"
vscode "oracle.mysql-shell-for-vs-code"
vscode "patbenatar.advanced-new-file"
vscode "plorefice.devicetree"
vscode "pranaygp.vscode-css-peek"
vscode "quantifiedleap.sql-transformer"
vscode "redhat.vscode-yaml"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sidthesloth.html5-boilerplate"
vscode "spadin.zmk-tools"
vscode "standard.vscode-standard"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "thqby.vscode-autohotkey2-lsp"
vscode "tomoki1207.pdf"
vscode "trond-snekvik.devicetree"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "voidei.vscode-vimrc"
vscode "vscode-icons-team.vscode-icons"
vscode "xabikos.javascriptsnippets"
vscode "yzane.markdown-pdf"
vscode "zainchen.json"
vscode "zero-plusplus.vscode-autohotkey-debug"
