aaron-bond.better-comments
alefragnani.project-manager
alefragnani.separators
artinmajdi.project-template-manager
asvetliakov.vscode-neovim
bierner.markdown-mermaid
bodil.file-browser
catppuccin.catppuccin-vsc
charliermarsh.ruff
chouzz.vscode-better-align
constneo.vscode-nushell-format
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
detachhead.basedpyright
dnut.rewrap-revived
dongli.python-preview
editorconfig.editorconfig
esbenp.prettier-vscode
evgeniypeshkov.syntax-highlighter
exodiusstudios.comment-anchors
felipecaputo.git-project-manager
felixzeller.markdown-oxide
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
foxundermoon.shell-format
franneck94.vscode-python-config
george-alisson.html-preview-vscode
gera2ld.markmap-vscode
gerrnperl.outline-map
github.remotehub
gitlab.gitlab-workflow
goessner.mdmath
google.geminicodeassist
grapecity.gc-excelviewer
gruntfuggly.todo-tree
hbenl.vscode-test-explorer
hediet.vscode-drawio
ibm.output-colorizer
inferrinizzard.prettier-sql-vscode
ionutvmi.path-autocomplete
james-yu.latex-workshop
janisdd.vscode-edit-csv
jgclark.vscode-todo-highlight
julianiaquinandi.nvim-ui-modifier
kaih2o.python-resource-monitor
kevinrose.vsc-python-indent
lancewilhelm.nvim-dashboard
leetcode.vscode-leetcode
louiswt.regexp-preview
marimo-team.vscode-marimo
marvhen.reflow-markdown
mechatroner.rainbow-csv
mhutchie.git-graph
mikestead.dotenv
mkhl.shfmt
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.references-view
ms-vscode.remote-repositories
ms-vscode.test-adapter-converter
nefrob.vscode-just-syntax
netcorext.uuid-generator
nickfode.latex-formatter
njpwerner.autodocstring
nopeslide.vscode-drawio-plugin-mermaid
oderwat.indent-rainbow
pomdtr.excalidraw-editor
postman.postman-for-vscode
randomfractalsinc.vscode-data-preview
redhat.vscode-yaml
rodolphebarbanneau.python-docstring-highlighter
spadin.zmk-tools
stackbreak.comment-divider
streetsidesoftware.code-spell-checker
takumii.markdowntable
tamasfe.even-better-toml
tecosaur.latex-utilities
thenuprojectcontributors.vscode-nushell-lang
tht13.html-preview-vscode
timonwong.shellcheck
tobias-z.vscode-harpoon
tomoki1207.pdf
tomoyukim.vscode-mermaid-editor
usernamehw.errorlens
vscode-icons-team.vscode-icons
vsls-contrib.gistfs
yatki.vscode-surround
yzhang.markdown-all-in-one
