aaron-bond.better-comments
asvetliakov.vscode-neovim
brettm12345.nixfmt-vscode
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
davidanson.vscode-markdownlint
detachhead.basedpyright
eamodio.gitlens
esbenp.prettier-vscode
exodiusstudios.comment-anchors
inferrinizzard.prettier-sql-vscode
james-yu.latex-workshop
kortina.vscode-markdown-notes
mathematic.vscode-latex
ms-python.python
njpwerner.autodocstring
patbenatar.advanced-new-file
quantifiedleap.sql-transformer
redhat.vscode-yaml
renesaarsoo.sql-formatter-vsc
shd101wyy.markdown-preview-enhanced
spadin.zmk-tools
tamasfe.even-better-toml
usernamehw.errorlens
vspacecode.whichkey
zainchen.json


# Later update

─❯ : codium --list-extensions --show-versions
aaron-bond.better-comments@3.0.2
alefragnani.project-manager@12.8.0
asvetliakov.vscode-neovim@1.18.20
bierner.markdown-mermaid@1.28.0
bodil.file-browser@0.2.11
catppuccin.catppuccin-vsc@3.17.0
charliermarsh.ruff@2025.22.0
chouzz.vscode-better-align@1.4.2
constneo.vscode-nushell-format@0.1.7
davidanson.vscode-markdownlint@0.59.0
dbaeumer.vscode-eslint@3.0.10
detachhead.basedpyright@1.29.1
dnut.rewrap-revived@1.16.3
dongli.python-preview@0.0.4
editorconfig.editorconfig@0.17.2
esbenp.prettier-vscode@11.0.0
evgeniypeshkov.syntax-highlighter@0.5.1
exodiusstudios.comment-anchors@1.10.4
felipecaputo.git-project-manager@1.8.2
felixzeller.markdown-oxide@1.1.0
formulahendry.auto-close-tag@0.5.15
formulahendry.auto-complete-tag@0.2.0
formulahendry.auto-rename-tag@0.1.10
franneck94.vscode-python-config@12.4.0
george-alisson.html-preview-vscode@0.2.5
gera2ld.markmap-vscode@0.2.10
gerrnperl.outline-map@1.4.2
github.remotehub@0.64.0
gitlab.gitlab-workflow@6.12.1
goessner.mdmath@2.7.4
google.geminicodeassist@2.32.0
grapecity.gc-excelviewer@4.2.63
gruntfuggly.todo-tree@0.0.226
hbenl.vscode-test-explorer@2.22.1
hediet.vscode-drawio@1.9.0
ibm.output-colorizer@0.1.2
inferrinizzard.prettier-sql-vscode@1.6.0
ionutvmi.path-autocomplete@1.25.0
james-yu.latex-workshop@10.9.0
janisdd.vscode-edit-csv@0.11.3
jgclark.vscode-todo-highlight@2.0.8
kaih2o.python-resource-monitor@0.3.0
kevinrose.vsc-python-indent@1.21.0
lancewilhelm.nvim-dashboard@0.1.4
leetcode.vscode-leetcode@0.18.4
louiswt.regexp-preview@0.1.5
marimo-team.vscode-marimo@0.6.3
mechatroner.rainbow-csv@3.19.0
mhutchie.git-graph@1.30.0
mikestead.dotenv@1.0.1
ms-python.debugpy@2025.6.0
ms-python.python@2025.4.0
ms-python.vscode-pylance@2025.4.1
ms-vscode.azure-repos@0.40.0
ms-vscode.remote-repositories@0.42.0
ms-vscode.test-adapter-converter@0.2.1
nefrob.vscode-just-syntax@0.8.0
netcorext.uuid-generator@0.0.5
nickfode.latex-formatter@1.0.5
njpwerner.autodocstring@0.6.1
nopeslide.vscode-drawio-plugin-mermaid@0.1.5
oderwat.indent-rainbow@8.3.1
pomdtr.excalidraw-editor@3.8.3
postman.postman-for-vscode@1.11.2
randomfractalsinc.vscode-data-preview@2.3.0
redhat.vscode-yaml@1.18.0
spadin.zmk-tools@1.5.0
stackbreak.comment-divider@0.4.0
streetsidesoftware.code-spell-checker@4.0.47
takumii.markdowntable@0.13.0
tamasfe.even-better-toml@0.21.2
tecosaur.latex-utilities@0.4.14
thenuprojectcontributors.vscode-nushell-lang@1.10.0
tht13.html-preview-vscode@0.2.5
timonwong.shellcheck@0.37.7
tobias-z.vscode-harpoon@1.5.0
tomoki1207.pdf@1.2.2
tomoyukim.vscode-mermaid-editor@0.19.1
usernamehw.errorlens@3.26.0
vscode-icons-team.vscode-icons@12.12.0
vsls-contrib.gistfs@0.8.2
yatki.vscode-surround@1.5.0
yzhang.markdown-all-in-one@3.6.3
(node:27046) [DEP0168] DeprecationWarning: Uncaught N-API callback exception detected, please run node with option --force-node-api-uncaught-exceptions-policy=true to handle those exceptions properly.
(Use `Electron --trace-deprecation ...` to show where the warning was created)
