vscode "aaron-bond.better-comments"
vscode "aflalo.dbml-formatter"
vscode "agutierrezr.vscode-neovim-pack"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "andenetalexander.vim-cheatsheet"
vscode "arrterian.nix-env-selector"
vscode "asvetliakov.vscode-neovim"
vscode "ban.spellright"
vscode "batisteo.vscode-django"
vscode "bnavetta.zoterolatex"
vscode "bocovo.dbml-erd-visualizer"
vscode "bodil.file-browser"
vscode "brettm12345.nixfmt-vscode"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cweijan.epub-reader"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "detachhead.basedpyright"
vscode "donjayamanne.python-environment-manager"
vscode "dunstontc.vscode-google-sheets-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "george-alisson.html-preview-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "goessner.mdmath"
vscode "grapecity.gc-excelviewer"
vscode "hongyin163.excel-to-html-table"
vscode "humao.rest-client"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ionide.ionide-fsharp"
vscode "iulian-radu-at.find-unused-exports"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jasew.vscode-helix-emulation"
vscode "jbockle.jbockle-format-files"
vscode "jebbs.markdown-extended"
vscode "jnoortheen.nix-ide"
vscode "juanallo.vscode-dependency-cruiser"
vscode "kaanaytekin.concise-sql-formatter"
vscode "kamadorueda.alejandra"
vscode "kevinrose.vsc-python-indent"
vscode "kortina.vscode-markdown-notes"
vscode "labnol.google-apps-script"
vscode "lacroixdavid1.vscode-format-context-menu"
vscode "leonidasiiv.google-sheets-equation-syntax-hightlighter"
vscode "marimo-team.vscode-marimo"
vscode "mathematic.vscode-latex"
vscode "matt-meyers.vscode-dbml"
vscode "mblode.zotero"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "molaidev.gscript-tools"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-repositories"
vscode "nachodecima.custom-css-sorter"
vscode "natqe.reload"
vscode "nhoizey.gremlins"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "oouo-diogo-perdigao.docthis"
vscode "oracle.mysql-shell-for-vs-code"
vscode "patbenatar.advanced-new-file"
vscode "plorefice.devicetree"
vscode "pranaygp.vscode-css-peek"
vscode "pylyzer.pylyzer"
vscode "quantifiedleap.sql-transformer"
vscode "redhat.vscode-yaml"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sidthesloth.html5-boilerplate"
vscode "skellock.just"
vscode "spadin.zmk-tools"
vscode "standard.vscode-standard"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "tobias-z.vscode-harpoon"
vscode "tomoki1207.pdf"
vscode "trond-snekvik.devicetree"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "voidei.vscode-vimrc"
vscode "vscode-icons-team.vscode-icons"
vscode "vspacecode.whichkey"
vscode "xabikos.javascriptsnippets"
vscode "yzane.markdown-pdf"
vscode "zainchen.json"
