aaron-bond.better-comments
asvetliakov.vscode-neovim
brettm12345.nixfmt-vscode
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
davidanson.vscode-markdownlint
detachhead.basedpyright
eamodio.gitlens
esbenp.prettier-vscode
exodiusstudios.comment-anchors
inferrinizzard.prettier-sql-vscode
james-yu.latex-workshop
kortina.vscode-markdown-notes
mathematic.vscode-latex
ms-python.python
njpwerner.autodocstring
patbenatar.advanced-new-file
quantifiedleap.sql-transformer
redhat.vscode-yaml
renesaarsoo.sql-formatter-vsc
shd101wyy.markdown-preview-enhanced
spadin.zmk-tools
tamasfe.even-better-toml
usernamehw.errorlens
vspacecode.whichkey
zainchen.json
