# -----------------------------------------------------------------------------
# Filename: ~/dotfiles/packages/Brewfile_Cask
# Github: https://github.com/Homebrew/homebrew-cask
# Source: https://formulae.brew.sh/cask/
# Description: Homebrew Cask packages and macOS-specific formulae.
# -----------------------------------------------------------------------------

# >>> Homebrew Taps <<<
tap "homebrew/bundle"                     # Manage multiple Homebrew dependencies
tap "homebrew/services"                   # Start/stop macOS services
tap "felixkratz/formulae"                  # Custom tools (e.g., SketchyBar, Borders)
tap "jesseduffield/lazygit"                # Fast Git UI
tap "nikitabobko/tap"                      # Miscellaneous useful CLI tools
tap "zegervdv/zathura"                     # Zathura PDF reader and extensions

# -----------------------------------------------
# macOS-Specific Formulae (CLI Utilities)
# -----------------------------------------------
brew "switchaudio-osx"                    # CLI for switching macOS audio devices
brew "nowplaying-cli"                     # Display currently playing media in the menu bar
brew "borders"                             # Adds borders to macOS windows
brew "lazygit"                             # Simple terminal UI for Git
brew "zathura"                             # Zathura PDF reader
brew "zathura-pdf-mupdf"                   # MuPDF plugin for Zathura

# -----------------------------------------------
# Casks: GUI Applications
# -----------------------------------------------

# >>> Media & Document Processing <<<
cask "adobe-digital-editions"              # eBook and document reader
cask "sioyek"                               # PDF reader optimized for research papers

# >>> Terminal Emulators <<<
cask "ghostty"                             # Minimal GPU-accelerated terminal
cask "wezterm"                             # GPU-accelerated terminal emulator

# >>> IDEs & Editors <<<
cask "zed"                                 # Keyboard-centric code editor
cask "vscodium"                            # Open-source version of Visual Studio Code
cask "visual-studio-code"                  # Lightweight code editor

# >>> SQL Clients <<<
cask "mysqlworkbench"                      # MySQL database management tool
cask "pgadmin4"                             # PostgreSQL database management tool

# >>> Productivity Tools <<<
cask "aerospace"                           # Window manager for macOS
# cask "alfred"                              # Productivity app launcher
cask "espanso"                             # Text expander
cask "chatgpt"                             # ChatGPT desktop app for macOS

# >>> Knowledge Management (PKM) <<<
cask "obsidian"                            # Markdown note-taking and PKM app
cask "anki"                                # Spaced repetition flashcard learning
cask "xournal++"                           # Handwritten notes and PDF annotation tool
cask "calibre"                             # eBook management and library software
cask "zotero"                              # Reference management tool

# >>> Office & Document Tools <<<
cask "libreoffice"                         # Open-source office suite
cask "libreoffice-language-pack"           # Language packs for LibreOffice

# >>> Cloud Storage <<<
cask "onedrive"                             # Microsoft cloud storage client
cask "google-drive"                         # Google Drive client for macOS

# >>> Browsers <<<
cask "zen-browser"                         # Minimalist web browser

# >>> Media Players <<<
cask "vlc"                                  # Open-source media player for video and audio

# >>> Communication <<<
cask "slack"                                # Team collaboration platform

# -----------------------------------------------
# Fonts
# -----------------------------------------------
cask "font-fira-code-nerd-font"             # Fira Code font with Nerd Font glyphs
cask "font-hack-nerd-font"                  # Hack font with Nerd Font glyphs
cask "font-jetbrains-mono-nerd-font"         # JetBrains Mono font with Nerd Font glyphs
cask "font-sf-mono"                         # Apple's SF Mono font
cask "font-sf-pro"                          # Apple's SF Pro font
cask "sf-symbols"                           # Apple's SF Symbols toolkit

# -----------------------------------------------
# VS Code Extensions
# -----------------------------------------------

# >>> UI & Themes <<<
vscode "dracula-theme.theme-dracula"
vscode "akamud.vscode-theme-onelight"
vscode "emmanuelbeziat.vscode-great-icons"

# >>> Code Navigation & Productivity <<<
vscode "alefragnani.project-manager"
vscode "eamodio.gitlens"                      # Git integration
vscode "exodiusstudios.comment-anchors"       # Anchors for code comments
vscode "aaron-bond.better-comments"           # Enhance code comments
vscode "chakrounanas.turbo-console-log"       # Quick console logs

# >>> Vim & Modal Editing <<<
vscode "andenetalexander.vim-cheatsheet"
vscode "asvetliakov.vscode-neovim"
vscode "jasew.vscode-helix-emulation"

# >>> Git & Version Control <<<
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ms-vscode.azure-repos"

# >>> Python Development <<<
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.debugpy"
vscode "ms-python.autopep8"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "kevinrose.vsc-python-indent"
vscode "donjayamanne.python-environment-manager"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "batisteo.vscode-django"

# >>> JavaScript, TypeScript, & Web Dev <<<
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "ecmel.vscode-html-css"
vscode "typescript-language-server"
vscode "george-alisson.html-preview-vscode"
vscode "ms-vscode.js-debug-nightly"

# >>> Markdown, LaTeX, & Writing <<<
vscode "jebbs.markdown-extended"
vscode "goessner.mdmath"
vscode "mathematic.vscode-latex"
vscode "james-yu.latex-workshop"
vscode "bnavetta.zoterolatex"
vscode "mblode.zotero"
vscode "kortina.vscode-markdown-notes"

# >>> SQL & Databases <<<
vscode "ms-mssql.mssql"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "matt-meyers.vscode-dbml"

# >>> C++ & Low-Level Development <<<
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.cmake-tools"

# >>> DevOps, Containers, & PowerShell <<<
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-repositories"

# >>> Data Science & Research <<<
vscode "hongyin163.excel-to-html-table"
vscode "grapecity.gc-excelviewer"
vscode "cweijan.epub-reader"
vscode "labnol.google-apps-script"
vscode "molaidev.gscript-tools"
vscode "dunstontc.vscode-google-sheets-syntax"

# >>> Nix Development <<<
vscode "jnoortheen.nix-ide"
vscode "arrterian.nix-env-selector"
vscode "brettm12345.nixfmt-vscode"

# >>> F# Development <<<
vscode "ionide.ionide-fsharp"

# >>> CSV, JSON, & Miscellaneous Formats <<<
vscode "mechatroner.rainbow-csv"
vscode "janisdd.vscode-edit-csv"
vscode "iulian-radu-at.find-unused-exports"

# >>> Linters & Formatters <<<
vscode "ban.spellright"                      # Spell checker
vscode "ms-python.black-formatter"           # Python formatter
vscode "charliermarsh.ruff"                   # Python linter
vscode "ms-python.isort"                      # Python import sorter
vscode "kamadorueda.alejandra"                # Nix formatter
vscode "davidanson.vscode-markdownlint"
vscode "markdownlint-cli2"
vscode "darkriszty.markdown-table-prettify"
vscode "kaanaytekin.concise-sql-formatter"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jbockle.jbockle-format-files"
vscode "lacroixdavid1.vscode-format-context-menu"

# >>> Miscellaneous Utilities <<<
vscode "spadin.zmk-tools"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "chrisdias.vscode-opennewinstance"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "ms-vscode.live-server"
vscode "humao.rest-client"
vscode "juanallo.vscode-dependency-cruiser"
vscode "leonidasiiv.google-sheets-equation-syntax-hightlighter"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "foam.foam-vscode"
